#include <cstring>
#include <string>
#include <weapon.h>
#include <room.h>
#include <map>
#include <people.h>
#include <book.h>
#include <thing.h>

using namespace std;

ro room[200] = {
	//客栈
	{
		"客栈",
		"inn",
		"这是一家非常热闹的客栈，每天人来人往",
		{"店小二","XiaoEr","这是这间客栈的服务员",2000,2000,100,50,100,100,110,200,{"拳","fist","拳","这是一个拳头"},{},0},
		{
			{"吃剩的鸡骨头","LeftChickenBone","棍","这是一根被吃剩的鸡骨头",2,2,2,2,2,2,2,16}
		},
		{
			{"破书","TatteredBook",{},1000000,{},{},"这是一本破书，里面什么也学不到",1}
		},
		{
			{"碎裂的宝石","CrackedGem","这是一个宝石",1},
			{"普通的宝石","CommonGem","这是一个宝石",3},
			{"美丽的宝石","BeautifulGem","这是一个宝石",5},
			{"无暇的宝石","FlawlessGem","这是一个宝石",10},
			{"完美的宝石","PerfectGem","这是一个宝石",20},
			{"神圣的宝石","SacredGem","这是一个宝石",50},
			{"独一无二的宝石","uniqueGem","这是一个宝石",100},
			{"世间难得的宝石","PreciousGem","这是一个宝石",500},
		},
		{"north", "south", "down", "up","gifthall"},
		{1,3,7,1,47},
		{
			/*weap["sword"],
			weap["longsword"],
			weap["iron_sword"],
			weap["blade"],
			weap["longblade"],
			weap["club"],
			weap["qimeigun"],
			weap["longclub"],
			weap["whip"],
			weap["longwhip"],*/
		},
		{},
		{},
		true
	},//0 激发任务：店小二
	//北大街1
	{
		"北大街",
		"South_Road",
		"这是一条街道，一直通往北门",
		{
			{"旅客","traveller","这是一个每天在城里乱转的旅客",5000,5000,100,100,100,1000,1100,200,weap["longsword"],{},0,{},{},{}, false, true},
			{"旅客","traveller","这是一个每天在城里乱转的旅客",5000,5000,100,100,100,1000,1100,200,weap["longsword"],{},0,{},{},{}, false, true},
			{"旅客","traveller","这是一个每天在城里乱转的旅客",5000,5000,100,100,100,1000,1100,200,weap["longsword"],{},0,{},{},{}, false, true},
		},
		{{"石头","stone","无","这是一颗石头",2,2,2,2,2,2,2,16},{"石头","stone","无","这是一颗石头",2,2,2,2,2,2,2,16},{"石头","stone","无","这是一颗石头",2,2,2,2,2,2,2,16}},
		{},
		{{"椅子","chair","这是一把椅子",150},{"椅子","chair","这是一把椅子",150},{"桌子","table","这是一张桌子",300}},
		{"north","south","west"},
		{2,0,46},
		{},
		{},
		{},
		false
	},//1
	//北大街2
	{
		"北大街",
		"South_Road",
		"这是一条街道，一直通往北门",
		{},
		{
			{"钢刀","blade","刀","这是一把钢刀",2500,200,1,0,10,-10,5,16,0,{}},
			//weap["blade"],
			{"石头","stone","无","这是一颗石头",1,0,0,0,0,0,0,16},
			{"石头","stone","无","这是一颗石头",1,0,0,0,0,0,0,16}
		},
		{
			{"追风步秘籍","zhuifeng-stepbook",
				{
					"「追风步」", "你一个「2随风而舞s」，身形飘忽不定，躲过了e这一招", "zhuifeng-step", 0, 1, "剑", 1, 0, 0, 10, 1, 0, 0, 0, false
				},
				0,
				{},
				{},
				"这是一本关于武当剑法的书",10000
			}
		},
		{},
		{"north","south","west"},
		{3,1,40},
		{},
		{},
		{},
		false
	},//2
	//南大街1
	{
		"南大街",
		"North_Road",
		"这是一条街道，一直通往南门",
		{
			{ "江湖大盗","robber","这是一个江湖大盗",20000,20000,2000,1000,1000,5000,5000,200,weap["blade"],{},0,{"血刀秘籍","xuedao-book",{"「血刀大法」", "6你咬破舌尖，顿时血气缠绕，「4血刀大法6」w一刀竟不加防守，直逼es", "xuedao", 500, 1, "刀", 100, 100, 100, 100, 100, 1, 10, 10 , true},0,{"「基本刀法」"},{600},"这是一本老旧的书，里面记载了血刀大法，不知道为什么会出现在这个蒙面大盗手中",10000000},{"屠龙刀","tulong-blade","刀","武林至尊，宝刀屠龙。号令天下，莫敢不从。",100000000,10000,10000,10000,10000,2000,2000,4},{}, false, true},
			{ "武神","god","他的功夫已经到达返璞归真的境界了",100000000,100000000,1000000,1000000,50000,50000,1000000,1000000,{"倚天剑","yitian-sword","剑","这是倚天剑，世间神剑",0,0,0,0,0,0,0,4},{{"「血刀大法」", "6e咬破舌尖，顿时血气缠绕，「4血刀大法6」w一刀竟不加防守，直逼向你s", "xuedao", 7500000, 15000, "刀", 100, 100, 100, 100, 100, 1, 10, 10, true}},1,{},{},{} },
		},
		{
			{"钢刀","blade","刀","这是一把钢刀",2500,200,1,0,10,-10,5,16,0,{}},
			//weap["blade"],
			{"树枝","branch","棍","这是从树上掉下来的一根树枝",1,1,1,1,1,1,1,16}
		},
		{{"基本剑法秘籍","swordbook",{"「基本剑法」", "", "sword", 0, 0, "剑", 0, 0, 5, 0, 2, 0, 0},0,{},{},"这本书记载了基本剑法的诀窍",2000}},
		{},
		{"north","south","east","west"},
		{0,6,5,45},
		{},
		{},
		{},
		false
	},//3
	//鬼门关
	{
		"鬼门关",
		"ghost_gate",
		"这里就是阴间入口鬼门关，可以看见许许多多哭泣的鬼魂走进大门",
		{{"白无常","Baiwuchang","他是白无常",10000,10000,2000,1000,20000,20000,200,200,{"拳","fist","拳","这是一个拳头",0,0,0,0,0,0,0,16},{},0},},
		{},
		{},
		{},
		{"out"},
		{0},
		{},
		{},
		{},
		false
	},//4
	//书店
	{
		"书店",
		"bookshop",
		"这是一间书店。",
		{{"图书管理员","librarian","这是一个图书管理员",2000,2000,100,50,100,100,110,200,{"尺子","ruler","棍","这是一把尺子",10,1,1,1,1,1,1,16},{},0}},
		{},
		{
			{"基本剑法秘籍","swordbook",{"「基本剑法」", "", "sword", 0, 0, "剑", 0, 0, 5, 0, 2, 0, 0},0,{},{},"这本书记载了基本剑法的诀窍",2000},
			{"基本刀法秘籍","bladebook",{"「基本刀法」", "", "blade", 0, 0, "刀", 0, 0, 5, 0, 2, 0, 0},0,{},{},"这本书记载了基本刀法的诀窍",2000},
			{"基本鞭法秘籍","whipbook",{"「基本鞭法」", "", "whip", 0, 0, "鞭", 0, 0, 5, 0, 2, 0, 0},0,{},{},"这本书记载了基本鞭法的诀窍",2000},
			{"基本棍法秘籍","clubbook",{"「基本棍法」", "", "club", 0, 0, "拳", 0, 0, 5, 2, 0, 0, 0},0,{},{},"这本书记载了基本棍法的诀窍",2000},
			{"基本拳法秘籍","fistbook",{"「基本拳法」", "", "fist", 0, 0, "拳", 0, 0, 5, 0, 2, 0, 0},0,{},{},"这本书记载了基本拳法的诀窍",2000},
			{"基本掌法秘籍","palmbook",{"「基本掌法」", "", "plam", 0, 0, "无", 0, 0, 5, 0, 2, 0, 0},0,{},{},"这本书记载了基本掌法的诀窍",2000},
			{"基本拳脚秘籍","unarmedbook",{"「基本拳脚」", "", "unarmed", 0, 0,"无", 0, 0, 5, 1, 1, 0, 0},0,{},{},"这本书记载了基本拳脚的诀窍",2000},
			{"基本轻功秘籍","dodgebook",{"「基本轻功」", "", "dodge", 0, 0, "无", 0, 0, 0, 2, 0, 0, 0},0,{},{},"这本书记载了基本轻功的诀窍",2000},
			{"基本内功秘籍","forcebook",{"「基本内功」", "", "force", 0, 0, "无", 10, 5, 0, 0, 0, 0, 0},0,{},{},"这本书记载了基本内功的诀窍",2000}
		},
		{{"书","book","这是一本书",10}},
		{"west"},
		{3},
		{},
		{
			{"倚天剑法秘籍","yitian-swordbook",{"「倚天剑法」", "你大叫：\n4倚天不出！\n1谁与争锋！s\n一式「4神剑佛威s」，屈腕云剑，剑光如彩碟纷飞，幻出点点星光飘向e", "yitian-sword", 20, 1, "剑", 1000, 500, 500, 100, 10, 10, 10, true, 20},0,{"「基本剑法」"},{500},"这本书记载了绝世神功倚天剑法的诀窍",1000000},
			{"空明拳秘籍","kongming-fistbook",{"「空明拳」", "你凝神聚力，以极快的速度出拳\n\t4空明拳之意！s", "kongming-fist", 10, 1, "拳", 1000, 500, 500, 100, 10, 1, 10, 200, true, 10},0,{"「基本拳法」"},{500},"这本书记载了学习空明拳的诀窍",1000000}
		},
		{},
		true
	},//5
	//南大街2
	{
		"南大街（练级区）",
		"North_Road",
		"这是一条街道，一直通往南门",
		{
			{"野狗","dog","这是一只野狗",3000,3000,150,70,100,100,110,200,{"抓","claw","抓","这是一个抓",0,0,0,0,0,0,0,16},{},0,{},{},{},false,true},
			{"野狗","dog","这是一只野狗",3000,3000,150,70,100,100,110,200,{"抓","claw","抓","这是一个抓",0,0,0,0,0,0,0,16},{},0,{},{},{},false,true},
			{"野狗","dog","这是一只野狗",3000,3000,150,70,100,100,110,200,{"抓","claw","抓","这是一个抓",0,0,0,0,0,0,0,16},{},0,{},{},{},false,true},
			{"野狗","dog","这是一只野狗",3000,3000,150,70,100,100,110,200,{"抓","claw","抓","这是一个抓",0,0,0,0,0,0,0,16},{},0,{},{},{},false,true},
			{"野狗","dog","这是一只野狗",3000,3000,150,70,100,100,110,200,{"抓","claw","抓","这是一个抓",0,0,0,0,0,0,0,16},{},0,{},{},{},false,true},
			{"野狗","dog","这是一只野狗",3000,3000,150,70,100,100,110,200,{"抓","claw","抓","这是一个抓",0,0,0,0,0,0,0,16},{},0,{},{},{},false,true},
			{"野狗","dog","这是一只野狗",3000,3000,150,70,100,100,110,200,{"抓","claw","抓","这是一个抓",0,0,0,0,0,0,0,16},{},0,{},{},{},false,true},
			{"野狗","dog","这是一只野狗",3000,3000,150,70,100,100,110,200,{"抓","claw","抓","这是一个抓",0,0,0,0,0,0,0,16},{},0,{},{},{},false,true},
			{"野狗","dog","这是一只野狗",3000,3000,150,70,100,100,110,200,{"抓","claw","抓","这是一个抓",0,0,0,0,0,0,0,16},{},0,{},{},{},false,true},
			{"野狗","dog","这是一只野狗",3000,3000,150,70,100,100,110,200,{"抓","claw","抓","这是一个抓",0,0,0,0,0,0,0,16},{},0,{},{},{},false,true},
			{"野狗","dog","这是一只野狗",3000,3000,150,70,100,100,110,200,{"抓","claw","抓","这是一个抓",0,0,0,0,0,0,0,16},{},0,{},{},{},false,true},
			{"野狗","dog","这是一只野狗",3000,3000,150,70,100,100,110,200,{"抓","claw","抓","这是一个抓",0,0,0,0,0,0,0,16},{},0,{},{},{},false,true},
			{"野狗","dog","这是一只野狗",3000,3000,150,70,100,100,110,200,{"抓","claw","抓","这是一个抓",0,0,0,0,0,0,0,16},{},0,{},{},{},false,true},
			{"野狗","dog","这是一只野狗",3000,3000,150,70,100,100,110,200,{"抓","claw","抓","这是一个抓",0,0,0,0,0,0,0,16},{},0,{},{},{},false,true},
		},
		{},
		{},
		{"千年古董","MillenniumAntiques","这是一个千年古董，看上去能买一个好价钱！",2000000},
		{"north","south"},
		{3,0},
		{},
		{},
		{},
		false
	},//6
	//副本区域（进入副本）
	{
		"副本区域（进入副本）",
		"instances_inter",
		"这是副本区域，玩家可以进入副本去赚取大量经验和铜钱",
		{},
		{},
		{},
		{
			{"您已进入副本区域，可以选择副本","捡起物品即可进入相应副本","您已进入副本区域，可以选择副本",0},
			{"富人家副本[建议经验1000时进入]","A","",0},
			{"森林副本[建议经验500时进入]","B","",0},
			{"胡斐副本[建议经验2500时进入]","C","",0},
			{"练习室[无条件即可进入]","D","",0},
		},
		{"up"},
		{0},
		{},
		{},
		{},
		false
	},//7
	//副本1: 财主家
	{},//财主家入口 8
	{},//大院 9
	{},//走廊1 10
	{},//走廊2 11
	{},//走廊3 12
	{},//走廊4 13
	{},//走廊5 14
	{},//走廊6 15
	{},//走廊7 16
	{},//接待室 17
	{},//密室 18
	{},//莲花池 19
	//副本2: 森林
	{},//林间空地 20
	{},//草丛 21
	{},//小树林 22
	{},//大树林 23
	{},//树林深处 24
	{},//洞穴 25
	//武当
	{
		"武当派",
		"wudang",
		"武当：血厚，防高，控制强，讲究以柔克刚。使用武器：剑",
		{
			{ "张三丰","ZhangSanFeng","这是一个糟糟蹋蹋的道士，武当派的掌门",1000000,1000000,50000,1000,1000,5000,5000,200,{"武当长剑","wudang-sword","剑","这是武当派的专用剑",0,0,0,0,0,0,0,2,1,{}},{ZhangSanfeng_skills[0],ZhangSanfeng_skills[1],ZhangSanfeng_skills[2],ZhangSanfeng_skills[3],ZhangSanfeng_skills[4],ZhangSanfeng_skills[5],ZhangSanfeng_skills[6],ZhangSanfeng_skills[7]},3,{},{},{},true },
			{ "周伯通","ZhouBoTong","这是武当派中算强的那个，号称老顽童",500000,500000,20000,1000,1000,5000,5000,200,{"太极剑","taiji-sword","剑","这是一把太极剑",100,100,100,100,100,100,100,6,1,{}},{ZhouBoTong_skills[0],ZhouBoTong_skills[1],ZhouBoTong_skills[2],ZhouBoTong_skills[3],ZhouBoTong_skills[4],ZhouBoTong_skills[5],ZhouBoTong_skills[6]},4,{},{},{},true },
			{ "宋远桥","SongYuanQiao","武当七侠之一",250000,250000,1000,100,100,4000,4000,200,{"太极剑","taiji-sword","剑","这是一把太极剑",100,100,100,100,100,100,100,6,3,{}},{SongYuanQiao_skills[0],SongYuanQiao_skills[1],SongYuanQiao_skills[2]},2,{},{},{},true },
		},
		{
			{"武当长剑","wudang-sword","剑","这是武当派的专用剑",3500,200,10,10,10,10,10,2,1,{}},
			{"武当长剑","wudang-sword","剑","这是武当派的专用剑",3500,200,10,10,10,10,10,2,1,{}},
			{"武当长剑","wudang-sword","剑","这是武当派的专用剑",3500,200,10,10,10,10,10,2,1,{}},
		},
		{
			{ "武当剑法秘籍","wudang-swordbook",{"「武当剑法」", "你一式「2三环套月s」，连续三招，手中w化作三道光朝e飞去", "wudang-sword", 2, 1, "剑", 2, 2, 2, 0, 2, 3, 2, 20, true, 2},0,{},{},"这是一本关于武当剑法的书",10000 },
			{ "武当身法秘籍","wudang-stepbook",{"「武当身法」", "你一招「2移步换行s」，双脚一用力，往旁边一闪，瞬间将e的招数躲了过去", "wudang-step", 0, 1, "无", 0, 0, 0, 3, 0, 0, 0, 20, false, 0},0,{},{},"这是一本关于武当身法的书",10000 }
		},
		{
			{ "木人桩","woodman","练功用的木人桩",100 },
			{ "木人桩","woodman","练功用的木人桩",100 },
		},
		{"down"},
		{0},
		{},
		{},
		{},
		false
	},//26
	//丐帮
	{
		"丐帮",
		"gaibang",
		"丐帮：近身缠斗，骤雨连打。使用武器：拳，棍",
		{
			{ "汪剑通","WangJianTong","丐帮帮主",1000000,1000000,50000,5000,2000,2000,2000,2000,weap["qimeigun"],{ZhangSanfeng_skills[0],ZhangSanfeng_skills[1],ZhangSanfeng_skills[2]},3,{},{},{},true },
			{ "马大元","MaDaYuan","丐帮副帮主",500000,500000,30000,1000,1500,1500,2000,2000,weap["qimeigun"],{ZhouBoTong_skills[0],ZhouBoTong_skills[1],ZhouBoTong_skills[2],ZhouBoTong_skills[3]},4,{},{},{},true },
			{ "吴长风","WuChangFeng","丐帮四大长老之一",250000,250000,1000,100,100,4000,4000,200,weap["qimeigun"],{SongYuanQiao_skills[0],SongYuanQiao_skills[1]},2,{},{},{},true },
		},
		{
			{"齐眉棍","qimeigun","棍","竹子做的一根棍子，立起来恰好到眉毛",1000,150,0,0,0,-10,20,1,2,{}},
			{"齐眉棍","qimeigun","棍","竹子做的一根棍子，立起来恰好到眉毛",1000,150,0,0,0,-10,20,1,2,{}},
			{"齐眉棍","qimeigun","棍","竹子做的一根棍子，立起来恰好到眉毛",1000,150,0,0,0,-10,20,1,2,{}}
			//weap["qimeigun"],
			//weap["qimeigun"],
			//weap["qimeigun"],
		},
		{
			{ "混天功秘籍","huntian-gongbook",{"「混天功」", "你错步上前，一招2靛沧海s之「2深渊势s」，双掌猛然卷一股滔天寒流，席卷e全身", "huntian-gong", 1, 1, "拳", 2, 2, 0, 0, 2, 5, 5, 20, true, 1},0,{"「基本拳法」","「基本拳脚」"},{10,10},"这是一本关于混天功的书",10000 },
			{ "铜锤手秘籍","tongchui-handbook",{"「铜锤手」", "你双手划弧，双掌轮番拍出，使一招「2威震八方s」砍向e的面门", "tongchui-hand", 2, 1, "无", 2, 2, 0, 0, 0, 3, 3, 5, true, 2},0,{"「基本拳法」","「基本拳脚」"},{20,20},"这是一本关于铜锤手的书",10000 }
		},
		{
			{ "木人桩","woodman","练功用的木人桩",100 },
			{ "木人桩","woodman","练功用的木人桩",100 },
		},
		{"down"},
		{0},
		{},
		{},
		{},
		false
	},//27
	{},//江岸 28
	{},//道路 29
	{},//木屋 30
	{},//宝库 31
	{},//江面1 32
	{},//江面2 33
	{},//江岸2 34
	{},//雪地1 35
	{},//雪地2 36
	{},//雪地3 37
	{},//雪地4 38
	//垃圾桶
	{
		"垃圾桶",
		"trashcan",
		"你是怎么进来的...",
		{},
		{
			{ "垃圾1","garbage1","垃圾","一个垃圾",0,0,0,0,0,0,0,16 },
			{ "垃圾2","garbage2","垃圾","一个垃圾",0,0,0,0,0,0,0,16 },
		},
		{
			{ "垃圾3","garbage3",{"「武当剑法」", "你一式「2三环套月s」，连续三招，手中w化作三道光朝e飞去", "wudang-sword", 2, 1, "剑", 2, 2, 2, 0, 2, 3, 2, 20, true, 20},0,{},{},"一个垃圾",0 },
			{ "垃圾4","garbage4",{"「武当身法」", "你一招「2移步换行s」，双脚一用力，往旁边一闪，瞬间将e的招数躲了过去", "wudang-step", 0, 1, "无", 0, 0, 0, 3, 0, 0, 0, 20, false, 0},0,{},{},"一个垃圾",0 },
			{ "垃圾5","garbage5",{"「倚天剑法」", "你大叫：\n4倚天不出！\n1谁与争锋！s\n一式「4神剑佛威s」，屈腕云剑，剑光如彩碟纷飞，幻出点点星光飘向e", "yitian-sword", 20, 1, "剑", 10, 50, 50, 10, 10, 10, 100, true, 20},0,{"「基本剑法」"},{500},"一个垃圾",0 },
			{ "垃圾6","garbage6",{"「空明拳」", "你凝神聚力，以极快的速度出拳\n\t4空明拳之意！s", "kongming-fist", 20, 1, "拳", 1000, 500, 500, 100, 10, 1, 10, true, 200},0,{"「基本拳法」"},{500},"一个垃圾",0 },
			{ "垃圾7","garbage7",{"「追风步」", "你一个「2随风而舞s」，身形飘忽不定，躲过了e这一招", "zhuifeng-step", 0, 1, "剑", 1, 0, 0, 10, 1, 0, 0, 0, false, 0},0,{},{},"一个垃圾",0 },
			{ "垃圾8","garbage8",{"「混天功」", "你错步上前，一招2靛沧海s之「2深渊势s」，双掌猛然卷一股滔天寒流，席卷e全身", "huntian-gong", 1, 1, "拳", 2, 2, 0, 0, 2, 5, 5, 20, true, 10},0,{"「基本拳法」","「基本拳脚」"},{10,10},"一个垃圾",0 },
			{ "垃圾9","garbage9",{"「铜锤手」", "你双手划弧，双掌轮番拍出，使一招「2威震八方s」砍向e的面门", "tongchui-hand", 2, 1, "拳", 2, 2, 0, 0, 0, 3, 3, 5, true, 20},0,{"「基本拳法」","「基本拳脚」"},{20,20},"一个垃圾",0 },
			{ "垃圾10","garbage10",{"「昊天掌」", "e使一招「5海上明月c」，左手轻轻一挥，劈向你", "haotian-fist", 2, 1, "拳", 2, 2, 2, 2, 2, 3, 3, 0, true, 20},0,{"「基本掌法」"},{30},"一个垃圾",0 },
			{ "垃圾11","garbage11",{"「太极剑」", "e虚步提腰，一招「6蜻蜓点水c」，手中q轻轻颤动，一剑剑点向你", "taiji-sword", 5, 1, "剑", 50, 25, 25, 5, 5, 2, 3, 1, true, 50},0,{"「基本剑法」"},{50},"一个垃圾",0 },
			{ "垃圾12","garbage12",{"天罡尘法「扫」字诀", "你身体往下一蹲，一招2天罡尘法s之「1扫s」字诀，手中w在空中一挥，再往e的小腿一扫", "tiangangwhip-sao", 3, 1, "鞭", 2, 0, 0, 0, 0, 1, 5, 20, true, 30},0,{"「基本鞭法」"},{10},"一个垃圾",0 },
			{ "垃圾13","garbage13",{"天罡尘法「连」字诀", "你手中w一抖，一式2天罡尘法s之「1连s」字诀，连续几招，挥向e", "tiangangwhip-lian", 1, 1, "鞭", 2, 2, 0, 0, 0, 5, 3, 5, true, 20},0,{"「基本鞭法」"},{20},"一个垃圾",0 },
			{ "垃圾14","garbage14",{"「铸剑法」", "你右脚往前一步，一招2铸剑法s之「2铸剑天下s」，手中w在空中划两圈，四周空气先后凝成剑状，向e刺去", "build-sword", 1, 1, "剑", 2, 0, 0, 0, 0, 5, 5, 20, true, 10},0,{"「基本剑法」"},{10},"一个垃圾",0 },
			{ "垃圾15","garbage15",{"「反弹剑法」", "你高举手中w，躲闪过e的攻击，顺着e的杀气，一式「2反弹绝技s」带着卷起的一股寒流，劈向e", "fantan-sword", 2, 1, "剑", 2, 2, 0, 0, 0, 3, 3, 5, true, 20},0,{"「基本剑法」"},{20},"一个垃圾",0 },
			{ "垃圾16","garbage16",{"「先天太极」", "你运转先天真气，双掌回圈，顿时一波澎湃的气劲直袭e，正是所学6先天太极s之「4先天功法s」", "xiantian-taiji", 5, 1, "拳", 0, 0, 0, 3, 0, 5, 0, 20, true, 50},0,{},{},"一个垃圾",0 },
			{ "垃圾17","garbage17",{"「云梯纵」", "e双手一挥，脚尖点地，一招「1云梯纵s」，瞬间变到了你的身后，使你的招数统统落空", "yunti-zong", 0, 1, "无", 2, 2, 2, 2, 2, 3, 3, 0, false, 0},0,{},{},"一个垃圾",0 },
			{ "垃圾18","garbage18",{"「太极拳」", "e左手回收，右手由钩变掌，由右向左，使一招「6提手上式s」，向你打来", "taiji-fist", 1, 1, "拳", 10, 5, 5, 1, 1, 5, 1, 1, true, 10},0,{},{},"一个垃圾",0 },
			{ "垃圾19","garbage19",{"「武当剑法」", "你一式「2三环套月s」，连续三招，手中w化作三道光朝e飞去", "wudang-sword", 2, 1, "剑", 2, 2, 2, 0, 2, 3, 2, 20, true},0,{},{},"一个垃圾",0 },
			{ "垃圾20","garbage20",{"「武当身法」", "你一招「2移步换行s」，双脚一用力，往旁边一闪，瞬间将e的招数躲了过去", "wudang-step", 0, 1, "无", 0, 0, 0, 3, 0, 0, 0, 20, false},0,{},{},"一个垃圾",0 },
			{ "垃圾21","garbage21",{"「武当剑法」", "你一式「2三环套月s」，连续三招，手中w化作三道光朝e飞去", "wudang-sword", 2, 1, "剑", 2, 2, 2, 0, 2, 3, 2, 20, true},0,{},{},"一个垃圾",0 },
			{ "垃圾22","garbage22",{"「武当身法」", "你一招「2移步换行s」，双脚一用力，往旁边一闪，瞬间将e的招数躲了过去", "wudang-step", 0, 1, "无", 0, 0, 0, 3, 0, 0, 0, 20, false},0,{},{},"一个垃圾",0 },
		},
		{
			{ "垃圾23","garbage23","一个垃圾",0 },
			{ "垃圾24","garbage24","一个垃圾",0 },
		},
		{"down"},
		{0},
		{},
		{},
		{},
		false
	},//39
	//矿洞
	{
		"矿洞",
		"cave",
		"这里到处都是矿，玩家可以在这里采集矿物",
		{},
		{},
		{},
		{
			{"输入mine <次数>来挖矿，挖一次10秒","","",0}
		},
		{"east"},
		{2},
		{},
		{},
		{},
		false
	},//40
	//铸剑山庄
	{
		"铸剑山庄",
		"zhujian_villa",
		"铸剑山庄：血厚，善近战，可反弹攻击。使用武器：自己制造的剑",
		{
			{ "张三丰","ZhangSanFeng","这是一个糟糟蹋蹋的道士，武当派的掌门",1000000,1000000,50000,1000,1000,5000,5000,200,{"武当长剑","wudang-sword","剑","这是武当派的专用剑",0,0,0,0,0,0,0,2,1,{}},{ZhangSanfeng_skills[0],ZhangSanfeng_skills[1],ZhangSanfeng_skills[2],ZhangSanfeng_skills[3],ZhangSanfeng_skills[4],ZhangSanfeng_skills[5],ZhangSanfeng_skills[6],ZhangSanfeng_skills[7]},3,{},{},{},true },
			{ "周伯通","ZhouBoTong","这是武当派中算强的那个，号称老顽童",500000,500000,20000,1000,1000,5000,5000,200,{"太极剑","taiji-sword","剑","这是一把太极剑",100,100,100,100,100,100,100,6,1,{}},{ZhouBoTong_skills[0],ZhouBoTong_skills[1],ZhouBoTong_skills[2],ZhouBoTong_skills[3],ZhouBoTong_skills[4],ZhouBoTong_skills[5],ZhouBoTong_skills[6]},4,{},{},{},true },
			{ "宋远桥","SongYuanQiao","武当七侠之一",250000,250000,1000,100,100,4000,4000,200,{"太极剑","taiji-sword","剑","这是一把太极剑",100,100,100,100,100,100,100,6,3,{}},{SongYuanQiao_skills[0],SongYuanQiao_skills[1],SongYuanQiao_skills[2]},2,{},{},{},true },
		},
		{
			weap["iron_sword"],
			weap["iron_sword"],
			weap["iron_sword"],
		},
		{
			{ "铸剑秘籍","build-swordbook",{"「铸剑法」", "你右脚往前一步，一招2铸剑法s之「2铸剑天下s」，手中w在空中划两圈，四周空气先后凝成剑状，向e刺去", "build-sword", 1, 1, "剑", 2, 0, 0, 0, 0, 5, 5, 20, true, 1},0,{"「基本剑法」"},{10},"这是一本关于铸剑法的书",10000 },
			{ "反弹剑法秘籍","fantan-swordbook",{"「反弹剑法」", "你高举手中w，躲闪过e的攻击，顺着e的杀气，一式「2反弹绝技s」带着卷起的一股寒流，劈向e", "fantan-sword", 2, 1, "剑", 2, 2, 0, 0, 0, 3, 3, 5, true, 2},0,{"「基本剑法」"},{20},"这是一本关于反弹剑法的书",10000 }
		},
		{
			{ "锻造台","forging_table","用来铸剑的锻造台",100 },
			{ "木人桩","woodman","练功用的木人桩",100 },
		},
		{ "down" },
		{ 0 },
		{},
		{},
		{},
		false
	},//41
	{},//练习室 42
	//道家
	{
		"道家",
		"daojia",
		"道家：学问多，攻击强。使用武器：拂尘",
		{
			{ "老子（《技能大乱斗》制作者）","Let_it_go","他是《技能大乱斗》游戏的制作者——Let it go。",1000000,1000000,50000,1000,1000,5000,5000,200,{"天罡尘","tiangang-whip","鞭","这是道家门派的拂尘",0,0,0,0,0,0,0,6},{ZhangSanfeng_skills[0],ZhangSanfeng_skills[1],ZhangSanfeng_skills[2],ZhangSanfeng_skills[3],ZhangSanfeng_skills[4],ZhangSanfeng_skills[5],ZhangSanfeng_skills[6],ZhangSanfeng_skills[7]},3,{},{},{},true },
			{ "文物管理局局长","JuZhang","NOI里的大佬",500000,500000,20000,1000,1000,5000,5000,200,{"天罡尘","tiangang-whip","鞭","这是道家门派的拂尘",0,0,0,0,0,0,0,6},{ZhouBoTong_skills[0],ZhouBoTong_skills[1],ZhouBoTong_skills[2],ZhouBoTong_skills[3],ZhouBoTong_skills[4],ZhouBoTong_skills[5],ZhouBoTong_skills[6]},4,{},{},{},true },
			{ "道家第四代弟子","DiZi","一个普普通通的弟子",250000,250000,1000,100,100,4000,4000,200,{"天罡尘","tiangang-whip","鞭","这是道家门派的拂尘",0,0,0,0,0,0,0,6},{SongYuanQiao_skills[0],SongYuanQiao_skills[1],SongYuanQiao_skills[2]},2,{},{},{},true },
		},
		{
			{"拂尘","dusting","鞭","这是一个拂尘，手柄用木头制成",100,50,0,100,0,-5,10,16},
			{"拂尘","dusting","鞭","这是一个拂尘，手柄用木头制成",100,50,0,100,0,-5,10,16},
			{"拂尘","dusting","鞭","这是一个拂尘，手柄用木头制成",100,50,0,100,0,-5,10,16},
		},
		{
			{ "天罡尘法【扫】字诀秘籍","tiangangwhip-saobook",{"天罡尘法「扫」字诀", "你身体往下一蹲，一招2天罡尘法s之「1扫s」字诀，手中w在空中一挥，再往e的小腿一扫", "tiangangwhip-sao", 3, 1, "鞭", 2, 0, 0, 0, 0, 1, 5, 20, true, 5},0,{"「基本鞭法」"},{10},"这是一本关于天罡尘法【扫】字诀的书",10000 },
			{ "天罡尘法【连】字诀秘籍","tiangangwhip-lianbook",{"天罡尘法「连」字诀", "你手中w一抖，一式2天罡尘法s之「1连s」字诀，连续几招，挥向e", "tiangangwhip-lian", 1, 1, "鞭", 2, 2, 0, 0, 0, 3, 3, 5, true, 3},0,{"「基本鞭法」"},{20},"这是一本关于天罡尘法【连】字诀的书",10000 }
		},
		{
			{ "木人桩","woodman","练功用的木人桩",100 },
		},
		{ "down" },
		{ 0 },
		{},
		{},
		{},
		false
	},//43
	//武道塔
	{
		"武道塔",
		"wudaota",
		"你现在处于1层",
		{
			{"张慧文","guard","他是武道塔1层的守卫者，你需要打败他，才能进入2层",1000,1000,100,10,1000,1000,0,0,{"精铁剑","iron_sword","剑","用精铁铸成的剑，很坚硬",100,100,0,0,0,-10,10,16},{},0,{},{},{},false},
		},
		{},
		{
			{"1，输入out离开","输入wudaota进入"},
			{"2，输入up进入下一层","要在击杀守卫后才能进入"},
		},
		{},
		{"out","up"},
		{0},
		{},
		{},
		{},
		false
	},//44
	//打铁铺
	{
		"打铁铺",
		"smithy",
		"叮叮当当的响声，让你觉得厌烦",
		{
			{"打铁工人","worker","他是在打铁铺工作的工人",1000,1000,100,10,1000,1000,0,0,{},{},0,{},{},{},false},
			{"打铁工人","worker","他是在打铁铺工作的工人",1000,1000,100,10,1000,1000,0,0,{},{},0,{},{},{},false},
			{"师傅","MasterWorker","他是那位工人的师傅",1000,1000,100,10,1000,1000,0,0,{},{},0,{},{},{},false},
		},
		{},
		{},
		{
			{"请勿击杀上面的好心人，不然你就不能打造自己的武器了...","系统提醒","请勿击杀上面两位好心人，不然你就不能打造自己的武器了..."},
			{"输入build来打造武器","系统提醒",""},
		},
		{"east"},
		{3},
		{},
		{},
		{},
		true
	},//45
	//任务地点
	{
		"官府",
		"government",
		"这里是官府发布榜文的地方，各大武林人士都会在这里领取任务",
		{
			{"刺客","assassin","这是正在领取任务的刺客",2000,2000,50,10,5000,5000,100,100,{"绣花针","needle","这是一把暗器","剑",0},{cike_skills[0],cike_skills[1]},1,{},{},{},false},
		},
		{},
		{},
		{
			{"告示","notice1"," ___________\n|两 朕 道 谁|\n|！ 赏 塔 敢|\n|   他 一 去|\n|   五 层 闯|\n|   银 ， 武|\n|___________|",0},
		},
		{"east"},
		{1},
		{},
		{},
		{},
		true
	},//46
	//活动大厅
	{
		"活动大厅",
		"hall",
		"这里是玩家们进入各种活动的地方",
		{
			{"礼包使者","GiftMessenger","他是这里专门派发奖品的人，身后背着一个袋子，里面不知道装着什么",2000,2000,50,10,5000,5000,100,100,{"拳头","fist","这是一个拳头","拳",0},{},0,{},{},{},false,false},
			{"西瓜","watermelon","一个又大又圆的西瓜",10000,10000},
			{"闯关的山东剑客","walker","武士 闯关的山东剑客\n他的功夫看起来不知所以\n他装备着:\n·精铁剑\n",3150,4230,230,30,1249,2112,234,260,weap["iron_sword"],{{},},0,{},{},{},false,false},
		},
		{},
		{},
		{},
		{"back"},
		{0},
		{},
		{},
		{},
		true
	},//47
};

ro instancesroom1[12] = {
	//财主家入口
	{
		"财主家入口",
		"inter",
		"面前就是大门了，击败门口的守卫就能进入",
		{
			{ "守卫","guard","守卫着大门的守卫，一个个身穿银甲，手持大刀",5000,5000,200,100,200,200,3000,3000,weap["blade"],{},0,{},{},{"钥匙（不能出售）","key","这把钥匙似乎是用来开大门的",1} },
			{ "守卫","guard","守卫着大门的守卫，一个个身穿银甲，手持大刀",5000,5000,200,100,200,200,3000,3000,weap["blade"],{},0,{},{},{"钥匙（不能出售）","key","这把钥匙似乎是用来开大门的",1} }
		},
		{},
		{},
		{{"小石头（别想着卖钱了，0元）","stone","你无不无聊...竟然还去捡这东西...",0}},
		{"east"},
		{9},
		{},
		{},
		{},
		false
	},
	//大院
	{
		"大院",
		"compound",
		"这人的大院可真大，足足有90平方米... 只见两个管家站在大院中央",
		{
			{ "管家","housekeeper","为庄主服务的仆人",2000,2000,100,50,100,100,200,200,weap["club"],{{"「绝门棍」", "e动用绝招「1绝门棍s」，原地一个后滚翻，却在落地的一刹那，身体向你平飞过去，手中q指向你的胸膛", "juemen-club", 1000, 100, "棍", 10, 10, 10, 10, 5, 1, 5, 5, true}},1,{},{},{} },
			{ "管家","housekeeper","为庄主服务的仆人",2000,2000,100,50,100,100,200,200,weap["club"],{{"「绝门棍」", "e动用绝招「1绝门棍s」，原地一个后滚翻，却在落地的一刹那，身体向你平飞过去，手中q指向你的胸膛", "juemen-club", 1000, 100, "棍", 10, 10, 10, 10, 5, 1, 5, 5, true}},1,{},{},{} },
		},
		{},
		{},
		{},
		{"north","south","east","west"},
		{10,11,17,8},
		{},
		{},
		{},
		false
	},
	//走廊1
	{
		"走廊",
		"corridor",
		"走在这里神清气爽，不远处就是莲花池",
		{},
		{},
		{},
		{},
		{"south","east"},
		{9,12},
		{},
		{},
		{},
		false
	},
	//走廊2
	{
		"走廊",
		"corridor",
		"走在这里神清气爽，不远处就是莲花池",
		{},
		{},
		{},
		{},
		{"north","east"},
		{9,13},
		{},
		{},
		{},
		false
	},
	//走廊3
	{
		"走廊",
		"corridor",
		"走在这里神清气爽，不远处就是莲花池",
		{},
		{},
		{},
		{},
		{"west","east"},
		{10,14},
		{},
		{},
		{},
		false
	},
	//走廊4
	{
		"走廊",
		"corridor",
		"走在这里神清气爽，不远处就是莲花池",
		{},
		{},
		{},
		{},
		{"west","east"},
		{11,16},
		{},
		{},
		{},
		false
	},
	//走廊5
	{
		"走廊",
		"corridor",
		"走在这里神清气爽，不远处就是莲花池",
		{},
		{},
		{},
		{},
		{"west","south"},
		{12,15},
		{},
		{},
		{},
		false
	},
	//走廊6
	{
		"走廊",
		"corridor",
		"走在这里神清气爽，不远处就是莲花池",
		{},
		{},
		{},
		{},
		{"north","south","east"},
		{14,16,19},
		{},
		{},
		{},
		false
	},
	//走廊7
	{
		"走廊",
		"corridor",
		"走在这里神清气爽，不远处就是莲花池",
		{},
		{},
		{},
		{},
		{"north","west"},
		{15,13},
		{},
		{},
		{},
		false
	},
	//接待室
	{
		"接待室",
		"ReceptionRoom",
		"这里是接待室，一位身强力壮的武将手持长剑站在里面",
		{
			{ "武将","general","站在这里的武将，凶神恶煞，带着一股杀气，手里握着宝剑",10000,10000,1000,100,1000,1000,10000,10000,weap["sword2"],{},0,{},{},{} },
		},
		{},
		{},
		{},
		{"west","down"},
		{10,18},
		{},
		{},
		{{"武将恶狠狠的说：“来者何人！报上姓名！”","","武将恶狠狠的说：“来者何人！报上姓名！”",0}},
		false
	},
	//密室
	{
		"密室",
		"SecretRoom",
		"这里是密室，一个潮湿的房间，你刚进去，门就“卡”的一声关了",
		{
			{ "武将","general","站在这里的武将，凶神恶煞，带着一股杀气，手里握着宝剑",10000,10000,1000,100,1000,1000,10000,10000,weap["sword2"],{},0,{},{},{} },
			{ "武将","general","站在这里的武将，凶神恶煞，带着一股杀气，手里握着宝剑",10000,10000,1000,100,1000,1000,10000,10000,weap["sword2"],{},0,{},{},{} },
			{ "财主","richman","这个大别墅的主人，他已经发疯了",10000,10000,1000,100,1000,1000,10000,10000,weap["sword2"],{},0,{},{},{"钱包[卖掉就会有2.5金]","bag","钱包",50000} }
		},
		{},
		{},
		{},
		{"out"},
		{0},
		{},
		{},
		{},
		false
	},
	//莲花池
	{
		"莲花池",
		"LotusPond",
		"这里是莲花池，花香四溢",
		{},
		{},
		{},
		{},
		{"west"},
		{16},
		{},
		{},
		{
			{"莲花","lotus","一朵清香四溢的莲花，因该会有人买",1000},
			{"莲花","lotus","一朵清香四溢的莲花，因该会有人买",1000},
			{"莲花","lotus","一朵清香四溢的莲花，因该会有人买",1000}
		},
		false
	},
};
ro instancesroom2[6] = {
	//林间空地
	{
		"林间空地",
		"glade",
		"你身处于林间空地，准备向森林出发",
		{
			{ "小虫子","bug","编程里的BUG，为了编程好，干了他！",1000,1000,100,10,100,100,100,100,{"拳头","fist","拳","这是一个拳头",0,0,0,0,0,0,0,16},{},0,{},{},{} },
			{ "小虫子","bug","编程里的BUG，为了编程好，干了他！",1000,1000,100,10,100,100,100,100,{"拳头","fist","拳","这是一个拳头",0,0,0,0,0,0,0,16},{},0,{},{},{} },
			{ "小虫子","bug","编程里的BUG，为了编程好，干了他！",1000,1000,100,10,100,100,100,100,{"拳头","fist","拳","这是一个拳头",0,0,0,0,0,0,0,16},{},0,{},{},{} },
		},
		{},
		{},
		{},
		{"west"},
		{21},
		{},
		{},
		{},
		false
	},
	//草丛
	{
		"草丛",
		"grass",
		"草丛中，似乎有什么东西在动，你拨开草丛，验证了你的猜想，一些动物对你发起了进攻！",
		{
			{ "小蛇","snake","一只无毒的小蛇，向你发起进攻",2000,2000,200,20,200,200,200,200,{"拳头","fist","拳","这是一个拳头",0,0,0,0,0,0,0,16},{},0,{},{},{} },
			{ "老鼠","mouse","一只小老鼠，向你发起进攻",1000,1000,100,10,5000,5000,100,100,{"拳头","fist","拳","这是一个拳头",0,0,0,0,0,0,0,16},{},0,{},{},{} },
			{ "老鼠","mouse","一只小老鼠，向你发起进攻",1000,1000,100,10,5000,5000,100,100,{"拳头","fist","拳","这是一个拳头",0,0,0,0,0,0,0,16},{},0,{},{},{} },
		},
		{},
		{},
		{},
		{"east","west"},
		{20,22},
		{},
		{},
		{},
		false
	},
	//小树林
	{
		"小树林",
		"woods",
		"往前走，树木越来越茂盛了",
		{
			{ "竹叶青","snake","一只竹叶青，含有剧毒",3000,3000,200,20,200,200,200,200,{"拳头","fist","拳","这是一个拳头",0,0,0,0,0,0,0,16},{{"「剧毒之咬」", "e的头向你猛扎过去，剧毒的牙齿在你身上造成了三个孔", "judu-bite", 1000, 100, "无", 10, 10, 10, 10, 10, 3, 10, 10, true}},1,{},{},{} },
		},
		{},
		{},
		{},
		{"east","west"},
		{21,23},
		{},
		{},
		{},
		false
	},
	//大树林
	{
		"大树林",
		"forest",
		"往前走，树木越来越茂盛了",
		{
			{ "竹叶青","snake","一只竹叶青，含有剧毒",3000,3000,200,20,200,200,200,200,{"拳头","fist","拳","这是一个拳头",0,0,0,0,0,0,0,16},{{"「剧毒之咬」", "e的头向你猛扎过去，剧毒的牙齿在你身上造成了三个孔", "judu-bite", 1000, 100, "无", 10, 10, 10, 10, 10, 3, 10, 10, true}},1,{},{},{} },
		},
		{},
		{},
		{},
		{"east","west"},
		{22,24},
		{},
		{},
		{},
		false
	},
	//树林深处
	{
		"树林深处",
		"forest",
		"这里只有几束光从茂盛的树叶中射出来，显得昏暗无比",
		{
			{ "竹叶青","snake","一只竹叶青，含有剧毒",3000,3000,200,20,200,200,200,200,{"拳头","fist","拳","这是一个拳头",0,0,0,0,0,0,0,16},{{"「剧毒之咬」", "e的头向你猛扎过去，剧毒的牙齿在你身上造成了三个孔", "judu-bite", 1000, 100, "无", 10, 10, 10, 10, 10, 3, 10, 10, true}},1,{},{},{} },
			{ "猛兽","Beast","一头猛兽，朝你冲过来",5000,5000,300,35,200,200,200,200,{"拳头","fist","拳","这是一个拳头",0,0,0,0,0,0,0,16},{{"「冲撞」", "e的头向你撞了过去", "chongzhuang", 2000, 100, "无", 10, 10, 10, 10, 10, 1, 10, 10, true}},1,{},{},{} },
			{ "猛兽","Beast","一头猛兽，朝你冲过来",5000,5000,300,35,200,200,200,200,{"拳头","fist","拳","这是一个拳头",0,0,0,0,0,0,0,16},{{"「冲撞」", "e的头向你撞了过去", "chongzhuang", 2000, 100, "无", 10, 10, 10, 10, 10, 1, 10, 10, true}},1,{},{},{} },
		},
		{},
		{},
		{},
		{"east","west"},
		{23,25},
		{},
		{},
		{},
		false
	},
	//洞穴
	{
		"洞穴",
		"den",
		"洞穴里面黑乎乎的，你感觉有东西在里面动",
		{
			{ "狼王","wolf","狼王，森林之王",5000,5000,500,40,4000,4000,200,200,{"拳头","fist","拳","这是一个拳头",0,0,0,0,0,0,0,16},{{"「朝天吼」", "e使一招「1朝天吼s」，声音穿透了整个森林", "chaotian-hou", 2000, 100, "无", 10, 10, 10, 10, 10, 1, 10, 10, true}},1,{},{},{"钱包[卖掉50银]","bag","卖掉50银",10000} },
		},
		{},
		{},
		{},
		{"east","out"},
		{24,0},
		{},
		{},
		{},
		false
	},
};
ro instancesroom3[11] = {
	//江岸
	{
		"江岸",
		"riverbank",
		"旁边的江面波涛汹涌",
		{
			{ "船夫","boatman","一位负责撑船的船夫",1000,1000,100,10,100,100,100,100,{"拳头","fist","拳","这是一个拳头",0,0,0,0,0,0,0,16},{},0,{"船桨","oar","棍","用来划船的船桨"},{},{} },
		},
		{},
		{},
		{},
		{"west","east"},
		{32,29},
		{},
		{},
		{},
		false
	},
	//道路
	{
		"道路",
		"road",
		"不远处可以看见一个木屋",
		{
			{ "黑熊","bear","一头黑熊，准备发起进攻",20000,20000,1000,100,1000,1000,1000,1000,{"拳头","fist","拳","这是一个拳头",0,0,0,0,0,0,0,16},{},0,{},{},{"熊胆","gall","一种上好的药材，能卖个好价钱",10000} },
			{ "黑熊","bear","一头黑熊，准备发起进攻",20000,20000,1000,100,1000,1000,1000,1000,{"拳头","fist","拳","这是一个拳头",0,0,0,0,0,0,0,16},{},0,{},{},{"熊胆","gall","一种上好的药材，能卖个好价钱",10000} },
		},
		{},
		{},
		{},
		{"north","west","east"},
		{30,28,31},
		{},
		{},
		{},
		false
	},
	//木屋
	{
		"木屋",
		"house",
		"一个温馨的木屋，中间站着胡斐",
		{
			{ "胡斐","HuFei","胡家刀法使用最好者胡一刀的儿子，有胡家刀法秘籍",75000,75000,6500,500,5000,5000,5000,5000,weap["blade"],{{"「闯王刀法」", "e挥舞q，使出一招「5气破金汤s」，上劈下撩，左挡右开，齐齐罩向你", "chuangwang-blade", 15000, 100, "刀", 10, 0, 0, 0, 0, 2, 4, 1,true}},0,{"闯王刀法秘籍","chuangwang-bladebook",{"「闯王刀法」", "e挥舞q，使出一招「5气破金汤s」，上劈下撩，左挡右开，齐齐罩向你", "chuangwang-blade", 3, 100, "刀", 10, 0, 0, 0, 0, 3, 20, 1,true},0,{"「基本刀法」"},{50},"这是一本记载着闯王刀法的书",200000},{},{"宝库钥匙","key","宝库的钥匙，听说里面藏着闯王宝刀...",0}},
		},
		{},
		{},
		{
			{ "那个阎基真的是可恶，自从抢了我们家胡家刀法两页，法力大涨，竟成了一个绿林大盗！","胡斐","胡斐：那个阎基真的是可恶，自从抢了我们家胡家刀法两页，法力大涨，竟成了一个绿林大盗！",0 },
			{ "少侠能否帮我一臂之力，除掉那个阎基。","胡斐","胡斐：少侠能否帮我一臂之力，除掉那个阎基。",0 },
		},
		{"south"},
		{29},
		{},
		{},
		{},
		false
	},
	//宝库
	{
		"宝库",
		"house",
		"你发现在宝库中间，躺着传说的闯王宝刀...",
		{},
		{{ "闯王宝刀","chuangwang-blade","刀","这是传说中失传的闯王宝刀",100000,2000,5400,1000,500,100,100,6 }},
		{},
		{},
		{"west"},
		{29},
		{},
		{},
		{},
		false
	},
	//江面1
	{
		"江面",
		"river",
		"波涛汹涌的江面",
		{},
		{},
		{},
		{{"渡船","boat","这是一艘渡船",0}},
		{"west","east"},
		{33,28},
		{},
		{},
		{},
		false
	},
	//江面2
	{
		"江面",
		"river",
		"波涛汹涌的江面",
		{},
		{},
		{},
		{{"渡船","boat","这是一艘渡船",0}},
		{"west","east"},
		{34,32},
		{},
		{},
		{},
		false
	},
	//江岸2
	{
		"江岸",
		"riverbank",
		"旁边的江面波涛汹涌",
		{
			{ "船夫","boatman","一位负责撑船的船夫",1000,1000,100,10,100,100,100,100,{"拳头","fist","拳","这是一个拳头",0,0,0,0,0,0,0,16},{},0,{"船桨","oar","棍","用来划船的船桨"},{},{} },
		},
		{},
		{},
		{},
		{"west","east"},
		{35,33},
		{},
		{},
		{},
		false
	},
	//雪地1
	{
		"雪地",
		"snowfield",
		"白茫茫一片，你迷失了方向...",
		{},
		{},
		{},
		{},
		{"south","east","north","west"},
		{36,34,35,35},
		{},
		{},
		{},
		false
	},
	//雪地2
	{
		"雪地",
		"snowfield",
		"白茫茫一片，你迷失了方向...",
		{},
		{},
		{},
		{},
		{"south","north","east","west"},
		{37,35,36,36},
		{},
		{},
		{},
		false
	},
	//雪地3
	{
		"雪地",
		"snowfield",
		"白茫茫一片，你迷失了方向...",
		{},
		{},
		{},
		{},
		{"south","north","east","west"},
		{38,36,37,37},
		{},
		{},
		{},
		false
	},
	//雪地4
	{
		"雪地",
		"snowfield",
		"在雪地里，你竟发现了胡斐的仇人阎基！！！",
		{
			{ "阎基","YanJi","胡斐的仇人，拿有胡家刀法秘籍中的三页",50000,50000,2000,200,2000,2000,2000,2000,weap["longblade"],{{"「胡家刀法」", "e蓦的使一招「1八方藏刀s」，顿时剑光中无数朵刀花从四面八方涌向你", "hujia-blade", 5000, 50, "刀", 10, 0, 0, 0, 0, 2, 15, 1,true}},0,{"胡家刀法秘籍","hujia-bladebook",{"「胡家刀法」", "你蓦的使一招「1八方藏刀s」，顿时剑光中无数朵刀花从四面八方涌向e", "hujia-blade", 2, 1, "刀", 10, 0, 0, 0, 0, 5, 20, 1,true},0,{"「基本刀法」"},{50},"这是一本记载着胡家刀法的书",100000},{},{}},
		},
		{},
		{},
		{},
		{"north","out"},
		{37,0},
		{},
		{},
		{},
		false
	},
};
ro instancesroom4[1] = {
	//练习室
	{
		"练习室",
		"fightingroom",
		"武生们都在这里练习武功",
		{
			{"野狗","dog","这是一只野狗",3000,3000,150,70,100,100,110,200,{"抓","claw","抓","这是一个抓",0,0,0,0,0,0,0,16},{},0},
			{"野狗","dog","这是一只野狗",3000,3000,150,70,100,100,110,200,{"抓","claw","抓","这是一个抓",0,0,0,0,0,0,0,16},{},0},
			{"野狗","dog","这是一只野狗",3000,3000,150,70,100,100,110,200,{"抓","claw","抓","这是一个抓",0,0,0,0,0,0,0,16},{},0},
			{"野狗","dog","这是一只野狗",3000,3000,150,70,100,100,110,200,{"抓","claw","抓","这是一个抓",0,0,0,0,0,0,0,16},{},0},
			{"野狗","dog","这是一只野狗",3000,3000,150,70,100,100,110,200,{"抓","claw","抓","这是一个抓",0,0,0,0,0,0,0,16},{},0},
			{"野狗","dog","这是一只野狗",3000,3000,150,70,100,100,110,200,{"抓","claw","抓","这是一个抓",0,0,0,0,0,0,0,16},{},0},
			{"野狗","dog","这是一只野狗",3000,3000,150,70,100,100,110,200,{"抓","claw","抓","这是一个抓",0,0,0,0,0,0,0,16},{},0},
			{"野狗","dog","这是一只野狗",3000,3000,150,70,100,100,110,200,{"抓","claw","抓","这是一个抓",0,0,0,0,0,0,0,16},{},0},
			{"野狗","dog","这是一只野狗",3000,3000,150,70,100,100,110,200,{"抓","claw","抓","这是一个抓",0,0,0,0,0,0,0,16},{},0},
			{"野狗","dog","这是一只野狗",3000,3000,150,70,100,100,110,200,{"抓","claw","抓","这是一个抓",0,0,0,0,0,0,0,16},{},0},
			{"野狗","dog","这是一只野狗",3000,3000,150,70,100,100,110,200,{"抓","claw","抓","这是一个抓",0,0,0,0,0,0,0,16},{},0},
			{"野狗","dog","这是一只野狗",3000,3000,150,70,100,100,110,200,{"抓","claw","抓","这是一个抓",0,0,0,0,0,0,0,16},{},0},
			{"野狗","dog","这是一只野狗",3000,3000,150,70,100,100,110,200,{"抓","claw","抓","这是一个抓",0,0,0,0,0,0,0,16},{},0},
			{"野狗","dog","这是一只野狗",3000,3000,150,70,100,100,110,200,{"抓","claw","抓","这是一个抓",0,0,0,0,0,0,0,16},{},0},
		},
		{},
		{},
		{},
		{"out"},
		{0},
		{},
		{},
		{},
		false
	},
};
