#include <cstring>
#include <string>

using namespace std;

struct sk {
	string name;
	string use;
	string Englishname;
	int damage;
	int level;
	string weapon;
	int plushealth;
	int plusforce;
	int plusattack;
	int plusdodge;
	int plushit;
	int attacknum;
	int cooldown;
	int forceneed;
	bool isattack;
	int timedamage;
};

sk myskill[100];

sk nowdodgeskill;

sk mybasicskill[9] = {
	{"「基本剑法」", "", "sword", 0, 0, "剑", 0, 0, 5, 0, 2, 0, 0},
	{"「基本刀法」", "", "blade", 0, 0, "刀", 0, 0, 5, 0, 2, 0, 0},
	{"「基本鞭法」", "", "whip", 0, 0, "鞭", 0, 0, 5, 0, 2, 0, 0},
	{"「基本棍法」", "", "club", 0, 0, "棍", 0, 0, 5, 2, 0, 0, 0},
	{"「基本拳法」", "", "fist", 0, 0, "拳", 0, 0, 5, 0, 2, 0, 0},
	{"「基本掌法」", "", "plam", 0, 0, "无", 0, 0, 5, 0, 2, 0, 0},
	{"「基本拳脚」", "", "unarmed", 0, 0, "无", 0, 0, 5, 1, 1, 0, 0},
	{"「基本轻功」", "", "dodge", 0, 0, "无", 0, 0, 0, 2, 0, 0, 0},
	{"「基本内功」", "", "force", 0, 0, "无", 10, 5, 0, 0, 0, 0, 0},
};

sk ZhangSanfeng_skills[8] = {
	{"「武当剑法」", "e一式「2三环套月s」，连续三招，手中q化作三道光朝你飞来", "wudang-sword", 100000, 1000, "剑", 2, 2, 2, 2, 2, 3, 3, 1, true, 2},
	{"「太极剑」", "e虚步提腰，一招「6蜻蜓点水s」，手中q轻轻颤动，一剑剑点向你", "taiji-sword", 100000, 1000, "剑", 10, 10, 10, 10, 10, 3, 3, 1, true, 2},
	{"「太极拳」", "e左手回收，右手由钩变掌，由右向左，使一招「6提手上式s」，向你打来", "taiji-fist", 100000, 1000, "拳", 1000, 500, 500, 100, 10, 5, 10, 1, true, 1},
	{"「昊天掌」", "e使一招「5海上明月s」，左手轻轻一挥，劈向你", "haotian-fist", 10000, 1000, "拳", 2, 2, 2, 2, 2, 3, 3, 50, true, 3},
	{"「空明拳」", "你凝神聚力，以极快的速度出拳\n\t4空明拳之意！s", "kongming-fist", 50000, 1000, "拳", 1000, 500, 500, 100, 10, 1, 10, 200, true, 10},
	{"「云梯纵」", "e双手一挥，脚尖点地，一招「1云梯纵s」，瞬间变到了你的身后，使你的招数统统落空", "yunti-zong", 0, 1000, "无", 2, 2, 2, 2, 2, 3, 3, 0, false, 0},
	{"「武当身法」", "你一招「2移步换行s」，双脚一用力，往旁边一闪，瞬间将e的招数躲了过去", "wudang-step", 0, 1000, "无", 0, 0, 0, 3, 0, 0, 0, 20, false, 0},
	{"「先天太极」", "你运转先天真气，双掌回圈，顿时一波澎湃的气劲直袭e，正是所学6先天太极s之「4先天功法s」", "xiantian-taiji", 100000, 1000, "拳", 0, 0, 0, 3, 0, 5, 0, 20, true, 5},
};

sk ZhouBoTong_skills[7] = {
	{"「昊天掌」", "e使一招「5海上明月s」，左手轻轻一挥，劈向你", "haotian-fist", 10000, 700, "拳", 2, 2, 2, 2, 2, 3, 3, 50, true, 3},
	{"「太极剑」", "e虚步提腰，一招「6蜻蜓点水s」，手中q轻轻颤动，一剑剑点向你", "taiji-sword", 70000, 700, "剑", 10, 10, 10, 10, 10, 3, 3, 1, true, 2},
	{"「太极拳」", "e左手回收，右手由钩变掌，由右向左，使一招「6提手上式s」，向你打来", "fist", 10000, 700, "拳", 10, 10, 10, 10, 2, 10, 1, 0, true, 5},
	{"「空明拳」", "你凝神聚力，以极快的速度出拳\n\t4空明拳之意！s", "kongming-fist", 50000, 700, "拳", 1000, 500, 500, 100, 10, 1, 10, 200, true, 10},
	{"「云梯纵」", "e双手一挥，脚尖点地，一招「1云梯纵s」，瞬间变到了你的身后，使你的招数统统落空", "yunti-zong", 0, 500, "无", 2, 2, 2, 2, 2, 3, 3, 0, false, 0},
	{"「武当剑法」", "e一式「2三环套月s」，连续三招，手中q化作三道光朝你飞来", "wudang-sword", 70000, 700, "剑", 2, 2, 2, 2, 2, 3, 3, 1, true, 2},
	{"「武当身法」", "你一招「2移步换行s」，双脚一用力，往旁边一闪，瞬间将e的招数躲了过去", "wudang-step", 0, 700, "无", 0, 0, 0, 3, 0, 0, 0, 20, false, 0},
};

sk SongYuanQiao_skills[3] = {
	{"「武当剑法」", "e一式「2三环套月s」，连续三招，手中q化作三道光朝你飞去", "wudang-sword", 10000, 500, "剑", 2, 2, 2, 0, 2, 3, 2, 20, true, 2},
	{"「云梯纵」", "e双手一挥，脚尖点地，一招「1云梯纵s」，瞬间变到了你的身后，使你的招数统统落空", "yunti-zong", 0, 500, "无", 2, 2, 2, 2, 2, 3, 3, 0, false, 0},
	{"「武当身法」", "你一招「2移步换行s」，双脚一用力，往旁边一闪，瞬间将e的招数躲了过去", "wudang-step", 0, 500, "无", 0, 0, 0, 3, 0, 0, 0, 20, false, 0},
};

sk cike_skills[3] = {
	{"「漫天花雨掷金针」", "e一式「6金针掷地s」。瞬间，e手中q一一掷向你", "mantian-huayu", 100, 300, "剑", 2, 2, 2, 0, 2, 5, 2, 20, true, 2},
	{"「倒转七星步」", "e一式「6翩翩若惊鸿s」，身不倾，脚不移，身体如行云流水般直滑出丈余。", "qixin-bu", 0, 300, "无", 1, 1, 2, 2, 2, 5, 5, 0, false, 0},
};

sk player1_skills[1] = {
	{"「武当剑法」", "e一式「2三环套月s」，连续三招，手中q化作三道光朝你飞去", "wudang-sword", 2000, 34, "剑", 2, 2, 2, 0, 2, 3, 2, 20, true, 2},
};

