#include <cstring>
#include <string>
#include <map>
#include <thing.h>

using namespace std;

struct we {
	string name;
	string Englishname;
	string type;
	string tell;
	int coin;
	int plusdamage;
	int plushealth;
	int plusforce;
	int plusdefense;
	int plusdodge;
	int plushit;
	int lv;
	int inlaynum;
	th inlaything[10];
};

map<string, we> weap = {
	{"sword",{"剑","sword","剑","这是一把普通的剑",100,100,0,0,0,-10,10,16,0,{}}},
	{"longsword",{"长剑","longsword","剑","这是一把长剑",200,150,0,0,0,-5,15,16,0,{}}},
	{"shortsword",{"短剑","shortsword","剑","这是一把短剑，虽然攻击力较低，但负重还可以",50,50,0,0,0,-2,5,16,0,{}}},
	{"brokensword",{"断剑","brokensword","剑","这是一把已经坏了的剑，似乎经历了多年的磨砺",25,25,0,0,0,-1,10,16,0,{}}},
	{"brokenblade",{"断刀","brokenblade","刀","这是一把已经坏了的刀，似乎经历了多年的磨砺",25,25,0,0,0,-1,10,16,0,{}}},
	{"longblade",{"长刀","longblade","刀","这是一把长刀，可以远距离攻击",300,250,0,0,0,-10,15,16,0,{}}},
	{"blade",{"钢刀","blade","刀","这是一把钢刀",2500,200,1,0,10,-10,5,16,0,{}}},
	{"iron_sword",{"精铁剑","iron_sword","剑","用精铁铸成的剑，很坚硬",100,100,0,0,0,-10,10,2,0,{}}},
	{"club",{"木棍","club","棍","普通的一根棍子，木头做的",700,100,0,0,0,-5,20,16,0,{}}},
	{"qimeigun",{"齐眉棍","qimeigun","棍","竹子做的一根棍子，立起来恰好到眉毛",1000,150,0,0,0,-10,20,1,2,{}}},
	{"ironclub",{"铁棍","ironclub","棍","铁制棍子，挥起来很有劲",1200,300,0,0,0,-20,20,2,0,{}}},
	{"longclub",{"长棍","longclub","棍","一根很长的棍子，攻击范围很大",1300,300,0,0,0,-25,30,16,0,{}}},
	{"whip",{"皮鞭","whip","鞭","这是一个普通的鞭子",1000,300,0,0,0,-5,20,16,0,{}}},
	{"longwhip",{"长鞭","longwhip","鞭","这是一个长鞭",1100,300,0,0,0,-10,20,16,0,{}}},
	{"heilong-bian",{"黑龙鞭","heilong-bian","鞭","这是黑龙史的鞭子",5000,1000,10,10,0,-10,30,1,2,{}}},
	{"yunlong-bian",{"云龙鞭","yunlong-bian","鞭","这是云龙长老的鞭子",5000,1000,10,10,0,-10,30,1,2,{}}},
	{"云龙剑",{}},
	{"拂尘",{}},
	{"将军剑",{}},
	{"大砍刀",{}},
	{"打狗棍",{}},
	{"倚天剑",{}},
	{"屠龙刀",{}},
	{"武当长剑",{}},
	{"太极剑",{}},
	{"八卦剑",{}},
	{"八卦刀",{}},
	{"八荒刀",{}},
	{"武士刀",{}},
	{"武当长剑",{}},
	{"黑龙鞭",{}},
	{"云龙鞭",{}},
	{"sword2",{"宝剑","sword","剑","这是一把宝剑",1000,100,10,10,1,-15,30,1}},
};

